
import random

#const
HANGMAN = (
"""
------
|    |
|    O
|  /-+-/
|    |
|    |
|   | |
|   | |
|
--------
""",
"""
------
|    |
|    O
|  /-+-/
|    |
|    |
|   |
|   |
|
--------
""",
"""
------
|    |
|    O
|  /-+-/
|    |
|
|
|
|
--------
""",
"""
------
|    |
|    O
|  /-+-/
|
|
|
|
|
--------
""",
"""
------
|    |
|    O
|   -+-
|
|
|
|
|
--------
""",
"""
------
|    |
|    O  |
|
|
|
|
|
|
--------
""",
"""
------
|    |
|
|
|
|
|
|
|
--------
"""
)
# MAX_WRONG = len(HANGMAN) - 1
WORDS = ('КНИГА', 'СТОЛ', 'ЭНЦИКЛОПЕДИЯ', 'ШКОЛА', 'ЗДОРОВЬЕ', 'ПРОГРАММИРОВАНИЕ')
word = random.choice(WORDS)
so_far = "*" * len(word) 
wrong = 6 
used = [] 
print("\t\tДобро пожаловать в игру 'Виселица'!")
print(
"""
Сейчас я загадаю Вам слово, а вы должны будете угадать его по буквам.
Вы будете угадывать по одной букве, если эта буква есть в моем слове, то
я открою вам ее положение в слове. Если же нет, то я буду дорисовывать человечка
на виселице.
Игра будет длиться до тех пор, пока вы не отгадаете слово, либо пока человечек не будет
полностью повешен (у Вас будет 6 попыток).
"""
)
while wrong > 0 and so_far != word:
    print(HANGMAN[wrong])
    print("\nВы уже предлагали следующие буквы:\n", used)
    print("\nОтгаданное Вами на данный момент:\n", so_far)
    print("У вас осталось ", wrong, "попыток!\n")
    guess = input("\n\nВведите букву: ")
    guess = guess.upper()
    while guess in used:
        print("Вы уже предлагали букву: ", guess)
        guess = input("\n\nВведите букву: ")
        guess = guess.upper()
    used.append(guess)
    if guess in word:
        print("\nДа, буква", guess, "есть в моем слове!")
        new = ""
        for i in range(len(word)):
            if guess == word[i]:
                new += guess
            else:
                new += so_far[i]
        so_far = new
    else:
        print("\nК сожалению, буквы", guess, "нет в моем слове.")
        wrong -= 1
if wrong == 0:
    print(HANGMAN[wrong])
    print("\nЧеловечка повесили!")
else:
    print("\nВы угадали слово!")
print("\nБыло загаданно слово", word, "!")
input("\n\nPress ENTER to EXIT.")



